In [1]:
import pandas as pd

In [2]:
#Q18
#for this question,you need a specifis package or library to grab adata from the web.
#use the following comment to install the package.
#on your command line window,type"conda install pandas-datareader" or "pip install pandas-datareader"
import pandas_datareader.data as web

In [5]:
all_data = {ticker:web.get_data_yahoo(ticker)
           for ticker in['SPY','GLD','SLV','USO','UUP']}

In [8]:
price=pd.DataFrame({ticker:data['Adj Close']
                   for ticker ,data in all_data.items()})

In [10]:
returns=price.pct_change()

In [12]:
returns.corr()

          SPY       GLD       SLV       USO       UUP
SPY  1.000000 -0.155413  0.056485  0.337243  0.061736
GLD -0.155413  1.000000  0.784663  0.047870 -0.453907
SLV  0.056485  0.784663  1.000000  0.182981 -0.383787
USO  0.337243  0.047870  0.182981  1.000000 -0.117309
UUP  0.061736 -0.453907 -0.383787 -0.117309  1.000000

In [13]:
#Silver and gold have the strongest relationship in terms of being positively related.
#when us dollar is appreciated then

In [2]:
#Q1
grades=pd.Series([90,85,79,92,93],index=['Jack','Joan','Max','Mike','Kevin',])
grades.index.name='Name'
grades.name='Exam Grades'

In [3]:
grades

Name
Jack     90
Joan     85
Max      79
Mike     92
Kevin    93
Name: Exam Grades, dtype: int64

In [4]:
#Q2
grades.max()

93

In [5]:
grades.min()

79

In [6]:
grades.mean()

87.8

In [7]:
#Q3
grades[grades>=grades.mean()]

Name
Jack     90
Mike     92
Kevin    93
Name: Exam Grades, dtype: int64

In [8]:
#Q4
grades[['Joan','Jack']]

Name
Joan    85
Jack    90
Name: Exam Grades, dtype: int64

In [9]:
#Q5
grades['Joan']=95

In [10]:
grades

Name
Jack     90
Joan     95
Max      79
Mike     92
Kevin    93
Name: Exam Grades, dtype: int64

In [11]:
#Q6
data={'Q1':[1200,1300,1100],'Q2':[1400,1500,1200],'Q3':[800,1600,1000],'Q4':[1100,1000,1050]}
frame=pd.DataFrame(data,index=['Dallas','Houston','Austin'])

In [12]:
frame

           Q1    Q2    Q3    Q4
Dallas   1200  1400   800  1100
Houston  1300  1500  1600  1000
Austin   1100  1200  1000  1050

In [13]:
#Q7
frame['Q3']

Dallas      800
Houston    1600
Austin     1000
Name: Q3, dtype: int64

In [14]:
frame.loc['Houston']

Q1    1300
Q2    1500
Q3    1600
Q4    1000
Name: Houston, dtype: int64

In [15]:
#Q8
frame=pd.DataFrame(data,columns=['Q1','Q2','Q3','Q4','Total'],index=['Dallas','Houston','Austin'])

In [16]:
frame

           Q1    Q2    Q3    Q4 Total
Dallas   1200  1400   800  1100   NaN
Houston  1300  1500  1600  1000   NaN
Austin   1100  1200  1000  1050   NaN

In [17]:
frame['Total']=frame.sum(axis=1).astype(int)

In [18]:
frame.columns.name='Quarter'
frame.index.name='City'
frame

Quarter    Q1    Q2    Q3    Q4  Total
City
Dallas   1200  1400   800  1100   4500
Houston  1300  1500  1600  1000   5400
Austin   1100  1200  1000  1050   4350

In [19]:
#Q9
frame.values

array([[1200, 1400,  800, 1100, 4500],
       [1300, 1500, 1600, 1000, 5400],
       [1100, 1200, 1000, 1050, 4350]], dtype=int64)

In [20]:
frame.index

Index(['Dallas', 'Houston', 'Austin'], dtype='object', name='City')

In [21]:
frame.columns

Index(['Q1', 'Q2', 'Q3', 'Q4', 'Total'], dtype='object', name='Quarter')

In [22]:
#Q10
frame2=frame.reindex(['Austin','Dallas','Houston'])

In [23]:
frame2

Quarter    Q1    Q2    Q3    Q4  Total
City
Austin   1100  1200  1000  1050   4350
Dallas   1200  1400   800  1100   4500
Houston  1300  1500  1600  1000   5400

In [24]:
#Q11
frame2[['Q2','Q3']]

Quarter    Q2    Q3
City
Austin   1200  1000
Dallas   1400   800
Houston  1500  1600

In [25]:
#Q12
frame2[frame2['Q3']>=1000]

Quarter    Q1    Q2    Q3    Q4  Total
City
Austin   1100  1200  1000  1050   4350
Houston  1300  1500  1600  1000   5400

In [26]:
#Q13
frame2.sort_values('Total',ascending=False,inplace=True)

In [27]:
frame2

Quarter    Q1    Q2    Q3    Q4  Total
City
Houston  1300  1500  1600  1000   5400
Dallas   1200  1400   800  1100   4500
Austin   1100  1200  1000  1050   4350

In [31]:
#Q14
frame2['Average']=frame2[['Q1','Q2','Q3','Q4']].mean(axis=1)

In [32]:
frame2

Quarter    Q1    Q2    Q3    Q4  Total  Average
City
Houston  1300  1500  1600  1000   5400   1350.0
Dallas   1200  1400   800  1100   4500   1125.0
Austin   1100  1200  1000  1050   4350   1087.5

In [35]:
#Q15
frame2.drop(['Total','Average'],axis=1,inplace=True)

In [36]:
frame2

Quarter    Q1    Q2    Q3    Q4
City
Houston  1300  1500  1600  1000
Dallas   1200  1400   800  1100
Austin   1100  1200  1000  1050

In [37]:
frame2.loc['San Antonio']=[1150,1200,900,1000]

In [38]:
frame2

Quarter        Q1    Q2    Q3    Q4
City
Houston      1300  1500  1600  1000
Dallas       1200  1400   800  1100
Austin       1100  1200  1000  1050
San Antonio  1150  1200   900  1000

In [39]:
#Q16
frame2.T

City     Houston  Dallas  Austin  San Antonio
Quarter
Q1          1300    1200    1100         1150
Q2          1500    1400    1200         1200
Q3          1600     800    1000          900
Q4          1000    1100    1050         1000

In [40]:
#Q17
frame2.describe()

Quarter           Q1      Q2           Q3           Q4
count       4.000000     4.0     4.000000     4.000000
mean     1187.500000  1325.0  1075.000000  1037.500000
std        85.391256   150.0   359.397644    47.871355
min      1100.000000  1200.0   800.000000  1000.000000
25%      1137.500000  1200.0   875.000000  1000.000000
50%      1175.000000  1300.0   950.000000  1025.000000
75%      1225.000000  1425.0  1150.000000  1062.500000
max      1300.000000  1500.0  1600.000000  1100.000000